In [1]:
import pandas as pd

### DataFrame的创建

In [3]:
pd.DataFrame({'one':[1,2,3,4], 'two':[4,3,2,1]})

   one  two
0    1    4
1    2    3
2    3    2
3    4    1

In [5]:
pd.DataFrame({'one':[1,2,3,4], 'two':[4,3,2,1]}, index=['a','b','c','d'])

   one  two
a    1    4
b    2    3
c    3    2
d    4    1

In [6]:
df = _
df

   one  two
a    1    4
b    2    3
c    3    2
d    4    1

In [12]:
df1 = pd.DataFrame({'one':pd.Series([1,2,3],index=['a','b','c']), 'two':pd.Series([1,2,3,4],index=['b','a','c','d'])})
df1

   one  two
a  1.0    2
b  2.0    1
c  3.0    3
d  NaN    4

### 将DataFrame转为csv

In [9]:
df.to_csv("test.csv")

In [10]:
df2 = pd.read_csv('test.csv')
df2

  Unnamed: 0  one  two
0          a    1    4
1          b    2    3
2          c    3    2
3          d    4    1

In [13]:
df1.to_csv('test1.csv')
df1_c = pd.read_csv('test1.csv')
df1_c

  Unnamed: 0  one  two
0          a  1.0    2
1          b  2.0    1
2          c  3.0    3
3          d  NaN    4

### DataFrame常用属性

In [14]:
df

   one  two
a    1    4
b    2    3
c    3    2
d    4    1

In [15]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [16]:
df.values

array([[1, 4],
       [2, 3],
       [3, 2],
       [4, 1]], dtype=int64)

In [17]:
df.T

     a  b  c  d
one  1  2  3  4
two  4  3  2  1

In [18]:
df.columns

Index(['one', 'two'], dtype='object')

In [19]:
df.describe() # 对每一列进行统计

            one       two
count  4.000000  4.000000
mean   2.500000  2.500000
std    1.290994  1.290994
min    1.000000  1.000000
25%    1.750000  1.750000
50%    2.500000  2.500000
75%    3.250000  3.250000
max    4.000000  4.000000